// *++
//
// Copyright (c) 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   DebugStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell debug command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"
#langdef   fra "Français"


#string STR_DEBUG_MUST_HAVE            #language eng  "%hs: Must specify '%s' for command %s\n"

#string STR_DEBUG_LACK_VALUE           #language eng  "%hs: Need value for flag '%s'\n"

#string STR_DEBUG_UNKNOWN_FLAG         #language eng  "%hs: Unknown flag '%s'\n"

#string STR_DEBUG_TOO_FEW_ARGS         #language eng  "%hs: Too few arguments\n"

#string STR_DEBUG_TOO_MANY_ARGS        #language eng  "%hs: Too many arguments\n"

#string STR_DEBUG_DEV_NOT_IO           #language eng  "%hs: Device is not a BlockIo device - %r\n"

#string STR_DEBUG_BLOCK_NOT_ZERO       #language eng  "%hs: Block # can not be zero\n"

#string STR_DEBUG_LBA_SIZE             #language eng  "\n LBA %016lx Size %08x bytes BlkIo %08x\n"

#string STR_DEBUG_READ_ERROR           #language eng  "%hs: Read error - %r\n"

#string STR_DEBUG_VALID_MBR            #language eng  "  Valid MBR\n  ---------\n"

#string STR_DEBUG_PARTITION_START      #language eng  "  Partition %d OS %02x Start %08x Size %08x\n"

#string STR_DEBUG_VALID_EFI_HEADER     #language eng  "  Valid EFI Header at %a %016lx\n  ----------------------------------------%a\n"

#string STR_DEBUG_TABLE_STRUCT         #language eng  "  %H%s: Table Structure%N size %08x revision %08x\n"

#string STR_DEBUG_HEADER_REV           #language eng  " Header %016lx Revision %08x Size %08x CRC %08x\n"

#string STR_DEBUG_LBA_UNUSABLE         #language eng  " LBA's %016lx - %016lx Unusable (%016lx)\n"

#string STR_DEBUG_FREE_SPACE           #language eng  " Free Space LBA %016lx Root LBA %016lx\n"

#string STR_DEBUG_BLOCK_SIZE           #language eng  " Block Size %08x Dir Allocation Units %08x\n"

#string STR_DEBUG_CONIN_CONOUT         #language eng  "  ConIn (%08x) ConOut (%08x) StdErr (%08x)\n"

#string STR_DEBUG_CONSOLE_IN_ON        #language eng  " Console In on  %s\n"

#string STR_DEBUG_CONSOLE_OUT_ON       #language eng  " Console Out on %s\n"

#string STR_DEBUG_STD_ERROR_ON         #language eng  " Std Error on   %s\n"

#string STR_DEBUG_RUNTIME_SERVICES     #language eng  "  Runtime Services     %016lx\n"

#string STR_DEBUG_BOOT_SERVICES        #language eng  "  Boot Services        %016lx\n"

#string STR_DEBUG_SAL_SYSTEM_TABLE     #language eng  "  SAL System Table     %016lx\n"

#string STR_DEBUG_ACPI_TABLE           #language eng  "  ACPI Table           %016lx\n"

#string STR_DEBUG_APCI_2_TABLE         #language eng  "  ACPI 2.0 Table       %016lx\n"

#string STR_DEBUG_MPS_TABLE            #language eng  "  MPS Table            %016lx\n"

#string STR_DEBUG_SMBIOS_TABLE         #language eng  "  SMBIOS Table         %016lx\n"

#string STR_DEBUG_FAT_BPB              #language eng  "%HFat %d%N BPB  "

#string STR_DEBUG_FATLABEL             #language eng  "FatLabel: '%.*a' SystemId: '%.*a' OemId: '%.*a'\n"

#string STR_DEBUG_FATLABEL_SYSTEMID    #language eng  "FatLabel: '%.*a'  SystemId: '%.*a' OemId: '%.*a'\n"

#string STR_DEBUG_SECTORSIZE           #language eng  " SectorSize %x  SectorsPerCluster %d"

#string STR_DEBUG_RES_SECTORS          #language eng  " ReservedSectors %d  # Fats %d\n Root Entries %x  Media %x"

#string STR_DEBUG_SECTORS              #language eng  "  Sectors %x  SectorsPerFat %x\n"

#string STR_DEBUG_SECTORSPERTRACK      #language eng  " SectorsPerTrack %x Heads %d\n"

#string STR_DEBUG_BLOCK_ADDR_OUT_RANGE #language eng  "%hs: Block address out of range. Max Address is %016x\n"

